# Python notebook for the movie data

In [1]:
print('hih')

hih

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### User dataset

In [3]:
user_cols =['user_id','age','sex','job','zip']
users = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.user',sep='|')
users.columns = user_cols
users.head()

   user_id  age sex         job    zip
0        2   53   F       other  94043
1        3   23   M      writer  32067
2        4   24   M  technician  43537
3        5   33   F       other  15213
4        6   42   M   executive  98101

### Rating Reading

In [4]:
rating_col=['user_id','movie_id','rating','unix_timestap']
ratings= pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.data',sep='\t')
ratings.columns = rating_col
ratings.head()

   user_id  movie_id  rating  unix_timestap
0      186       302       3      891717742
1       22       377       1      878887116
2      244        51       2      880606923
3      166       346       1      886397596
4      298       474       4      884182806

### Movie details

In [5]:
movies = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.item',sep='|',encoding='latin-1',usecols = range(5))
m_cols = ['movie_id','title', 'release_date','video_release_date', 'imdb_url']
movies.columns= m_cols
movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
1,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
2,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
3,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)
4,6,Shanghai Triad (Yao a yao yao dao waipo qiao) ...,01-Jan-1995,NaN,http://us.imdb.com/Title?Yao+a+yao+yao+dao+wai...

### Information about data

In [6]:
movies.dtypes

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object

In [7]:
movies.describe()

          movie_id  video_release_date
count  1681.000000                 0.0
mean    842.000000                 NaN
std     485.407217                 NaN
min       2.000000                 NaN
25%     422.000000                 NaN
50%     842.000000                 NaN
75%    1262.000000                 NaN
max    1682.000000                 NaN

In [8]:
ratings.dtypes

user_id          int64
movie_id         int64
rating           int64
unix_timestap    int64
dtype: object

In [9]:
ratings.describe()

            user_id      movie_id        rating  unix_timestap
count  99999.000000  99999.000000  99999.000000   9.999900e+04
mean     462.487415    425.531965      3.529865   8.835289e+08
std      266.614421    330.799501      1.125678   5.343878e+06
min        1.000000      1.000000      1.000000   8.747247e+08
25%      254.000000    175.000000      3.000000   8.794487e+08
50%      447.000000    322.000000      4.000000   8.828269e+08
75%      682.000000    631.000000      4.000000   8.882600e+08
max      943.000000   1682.000000      5.000000   8.932866e+08

In [10]:
columns_i_want=['user_id','job']
users[columns_i_want].head()

   user_id         job
0        2       other
1        3      writer
2        4  technician
3        5       other
4        6   executive

In [11]:
users.head()

   user_id  age sex         job    zip
0        2   53   F       other  94043
1        3   23   M      writer  32067
2        4   24   M  technician  43537
3        5   33   F       other  15213
4        6   42   M   executive  98101

In [12]:
male_and_above40 = users[(users.sex=='M')&(users.age>40)]
male_and_above40.head()

    user_id  age sex            job    zip
4         6   42   M      executive  98101
5         7   57   M  administrator  91344
8        10   53   M         lawyer  90703
11       13   47   M       educator  29206
12       14   45   M      scientist  55106

In [13]:
female_and_programmers= users[(users.sex=='F')&(users.job=='programmer')]

In [14]:
female_and_programmers.head()

     user_id  age sex         job    zip
290      292   35   F  programmer  94703
298      300   26   F  programmer  55106
350      352   37   F  programmer  55105
402      404   29   F  programmer  55108
419      421   38   F  programmer  55105

In [15]:
#show the statistic summery
print(female_and_programmers.describe())

##alternative:
print (female_and_programmers.age.mean())
print(female_and_programmers['age'].mean())

          user_id        age
count    6.000000   6.000000
mean   411.166667  32.166667
std    149.987222   5.115336
min    292.000000  26.000000
25%    313.000000  28.250000
50%    378.000000  32.000000
75%    416.750000  36.500000
max    698.000000  38.000000
32.166666666666664
32.166666666666664

## Split-apply-combine

#### Find Diligent Users
* split data per user ID
* count ratings
* combine result

In [16]:
print (ratings.head())

#splitting data
#grouped_data= ratings.groupby('user_id')
grouped_data= ratings['movie_id'].groupby(ratings['user_id'])
#grouped_data.head()

##count and combine 
ratings_per_user= grouped_data.count()

ratings_per_user.head(5)

   user_id  movie_id  rating  unix_timestap
0      186       302       3      891717742
1       22       377       1      878887116
2      244        51       2      880606923
3      166       346       1      886397596
4      298       474       4      884182806

user_id
1    272
2     62
3     54
4     24
5    175
Name: movie_id, dtype: int64

### get the average rating per movie

In [17]:
print (ratings.head())

#splitting data

grouped_data= ratings['rating'].groupby(ratings['movie_id'])

#average and combine
average_ratings= grouped_data.mean()
print("average_ratings")

print(average_ratings.head(5))

   user_id  movie_id  rating  unix_timestap
0      186       302       3      891717742
1       22       377       1      878887116
2      244        51       2      880606923
3      166       346       1      886397596
4      298       474       4      884182806
average_ratings
movie_id
1    3.878319
2    3.206107
3    3.033333
4    3.550239
5    3.302326
Name: rating, dtype: float64

### Best movies

In [42]:

#splitting data

grouped_data= ratings['rating'].groupby(ratings['movie_id'])

#average and combine
average_ratings= grouped_data.mean()

#taking the max value of the avergae_ratings

maximum_ratings= average_ratings.max()
good_movie_ids= average_ratings[average_ratings==maximum_ratings].index
print('Good movie ids')
print(good_movie_ids)

Good movie ids
Int64Index([814, 1122, 1189, 1201, 1293, 1467, 1500, 1536, 1599, 1653], dtype='int64', name='movie_id')

In [43]:
print("Best movie titles")

#looking 'good_movie_ids' in the movies table and print the title

print(movies[movies.movie_id.isin(good_movie_ids)].title)

Best movie titles
812                         Great Day in Harlem, A (1994)
1120                       They Made Me a Criminal (1939)
1187                                   Prefontaine (1997)
1199           Marlene Dietrich: Shadow and Light (1996)
1291                                      Star Kid (1997)
1465                 Saint of Fort Washington, The (1993)
1498                            Santa with Muscles (1996)
1534                                 Aiqing wansui (1994)
1597                        Someone Else's America (1995)
1651    Entertaining Angels: The Dorothy Day Story (1996)
Name: title, dtype: object